{
  "preIP": "http://",
  "postIP": ":9000/admin/chain/0x1",
  "path1" : "/admin/chain/0x1",
  "port1" : 9000,
  "path2":  "/api/v3",
  "msg0" : "Run /start command to configure bot",
  "msg1": "To initialize the bot, add a node or citizen node to monitor using the menu\\.\n\nClick on the '*Nodes*' button to add any node you would like to monitor\\.\n\nClick on the '*Reports*' button to add users to a report list\\.\nThe users in this list will recieve an alert in the case any of the nodes being monitored is offline or lagging by more than 100 blocks compared to the ICON Network\\.",
  "msg2": "You havent added any nodes to monitor, send '/start' command and use the option 'Add Node'",
  "msg3": "Use the 'Add node' button to add nodes you would like to check and monitor. With the 'Edit' and 'Check' buttons you can remove nodes from your list of monitored nodes and see the nodes you are currently monitoring",
  "msg4": "This bot runs a recursive check every minute to verify the status of the nodes you are currently monitoring. To activate this check use the 'Add user/group' button, any user or group you add to this list will receive alerts in the case any of your nodes is currently offline or lagin in blocks by more than 100 blocks compared to the ICON Network. You can use the 'Edit' and 'Check' buttons to remove users from this list and check the list",
  "msg5": "No user has been added to the report list, use the '/addMeToReport' command to add yourself to the list, if you want to add another user to the report list they have to send the command themselves via dm message to the bot, and if you want a group to be added, first add the bot to the group and send the '/addGroupToReport' command",
  "msg6": "The following is a list of users that are currently receiving alerts on your monitored nodes, to remove them from the report list simply reply with their usernames separated by spaces (i.e '@user1 @user2)\n\n",
  "msg7": "The following users and/or groups will receive alerts messages from the bot in case the nodes being monitored are offline or lagging in blocks by more than 100 blocks:\n\n",
  "replyCmdString": "Use the /help command to get a description of this bot",
  "infoCmdString": "This is the 'icon-node-monitor' bot created by ICON Prep Team Espanicon, to know more about this bot functionality please visit the bot github repo (https://github.com/FidelVe/icon-node-monitor).\n\nThis is a list of commands you can use with this bot:\n\n/start => command used to initialize the bot.\n/info => prints this message\n/checkMonitoredNodesHeight => prints the block gap between the ICON chain and the nodes to be monitored\n/checkMonitoredAndBlockProducersHeight => prints the current block in the chain and the highest block for each block producer and your monitored nodes\n/checkBlockProducersHeight => prints the current block in the chain and the highest block for each block producers\n/updatePrepsList => Updates the list of block producers to check (Preps).\n/showListOfPreps => Replies with a list of the block producers in the network (Preps).\n/addMeToReport => If the bot is unlocked the user that sends this command will be added to the report list.\n/addGroupToReport => If the bot has been added to a group and also made a moderator of the group, after sending this command the bot will add this group to the report list and will send alert messages to the group.\n/unlock => If the bot admin sends this command the bot will be unlocked and anyone that talks to the bot will be able to add/remove nodes from the monitored list and users from the report list, they will also be able to activate/deactivate the version check recursive task\n/lock => After receiving this command the bot will be locked, only the bot admin will be able to unlock it and make changes to the different configurations of the bot\n/testReport => this command sends a test message to all users in the report list\n/showListOfMonitored => Replies with the list of nodes being monitored\n/summary => Replies with a summary of all the nodes state, goloop version and users in the report list.\n/versionCheck (start | stop | run) => This command can be send with either 'start', 'stop' or 'run' flag. 'start' will activate the recursive check for the node goloop version (activated by default), 'stop' will deactivate the check and 'run' will immediately run a version check\n.",
  "defaultErrorMsg": "Unexpected Error while running command",
  "NODES_BLOCK_HEIGHT_REPLIES": {
    "msg0": "Block height status of nodes: \n",
    "msg1": "Running command, this might take a minute, please wait...",
    "msg2": "Error querying the nodes",
    "msg3": "✅ Node Status Message ✅\n\nNode block height recovered",
    "msg4" : "❌ Node Status Message ❌\n\nNode block height out of sync"
  },
  "actions": {
    "add": {
      "tag": "ADD_NODE",
      "label": "ADD_NODE_WIZARD",
      "msg": "Add node"
    },
    "edit": {
      "tag": "EDIT_NODES",
      "label": "EDIT_NODES_WIZARD",
      "msg": "Edit nodes"
    },
    "check": {
      "tag": "CHECK_NODES",
      "label": "CHECK_NODES_WIZARD",
      "msg": "Check nodes"
    },
    "nodes": {
      "tag": "SHOW_NODES",
      "label": "SHOW_NODES_WIZARD",
      "msg": "Nodes"
    },
    "task": {
      "tag": "ENTER_REPORT",
      "label": "ENTER_REPORT_WIZARD",
      "msg": "Reports"
    },
    "add_task": {
      "tag": "ADD_REPORT",
      "label": "ADD_REPORT_WIZARD",
      "msg": "Add user/group"
    },
    "edit_task": {
      "tag": "EDIT_REPORT",
      "label": "EDIT_REPORT_WIZARD",
      "msg": "Edit user/group"
    },
    "check_task": {
      "tag": "CHECK_REPORT",
      "label": "CHECK_REPORT_WIZARD",
      "msg": "Check list"
    }
  }
}
